Feature: Показване на окончателно класиране

	Background:
	  Given Потребителя отваря екрана за окончателното класиране

  Scenario: Родител търси класирането на децата си
    Then Вижда резултат: "[1]"
    
  Scenario Outline: Админ търси класиране на деца
    Given Потребителя отваря екрана за окончателното класиране
    When Въвежда телефонния номер на родителя: "<Телефон>"
    Then Админът вижда резултат: "<Списък>"
    
  Examples:
    |Телефон|Списък|
    |0892345674|[2,3]|
    |0892345671|[7]|
    |0892345672|[4,5,6]|
    
    
