Feature: Вход в системата

	Background:
	  Given Потребителя отваря екрана за вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    When Въведе "Ivan1" потребителско име
    And въведе парола: "Pass123!"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Успешно влизане."
    
  Scenario: Вход в системата без потребителско име
    When въведе парола: "pass1234"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете потребителско име и парола."
    
  Scenario: Вход в системата без парола
    When Въведе "Ivan" потребителско име
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете потребителско име и парола."
    
  Scenario: Вход в системата без входни данни
    When натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете потребителско име и парола."
    
  Scenario: Вход в системата с грешнo потребителскo име
    When Въведе "Грешно име" потребителско име
    And въведе парола: "Pass123!"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Грешно потребителско име или парола."
    
	Scenario: Вход в системата с грешна парола
    When Въведе "Ivan1" потребителско име
    And въведе парола: "wrong password"
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Грешно потребителско име или парола."
