Feature: Регистрация на потребител

 
  Scenario Outline: Регистрация на потребител
    Given Потребителя отваря екрана за регистрация на потребител
    When Въвежда потребитесло име: "<Потребителско име>"
    And Въвежда първа парола: "<парола>"
    And Въвежда втора парола: "<потв. парола>"
    And Въвежда електронна поща: "<Email>"
    And Въвежда телефонен номер: "<Phone>"
    And Въвежда собственото си име: "<Соб. Име>"
    And Въвежда фамилното си име: "<Фам. Име>"
    And Натиска бутона за регистрация
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      | Потребителско име  | парола       |потв. парола   |Email           |Phone     |Соб. Име |Фам. Име |Съобщение                    |
      | Pesho              |   Pass123!   | Pass123!      | pesho@abv.bg   |0891234567| Петър   | Петров |Регистрирахте се успешно.    |
      | Pesho              |   Pas        | Pas           | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете парола с поне четери знака.    |
      | Pe                 |   Pass123!   | Pass123!      | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете име с поне три знака.|
      | Ivan1              |   Pass123!   | Pass123!      | pesho1@abv.bg  |1234567892| Петър   | Петров |Потребителското име е заето. |
      | Pesho2             |   Pass123!   | Pass123!      | iIvanov1@abv.bg |1234567892| Петър   | Петров |Има регистриран потребител с тази поща. |
      | Pesho              |   Pass123!   | Pass123!      |                |1234567892| Петър   | Петров |Въведете електронна поща.    |
      | Pesho              |   Pass123!   | Pass123!      |   pesho        |1234567892| Петър   | Петров |Въведете валидна електронна поща.|
      |                    |   Pass123!   | Pass123!      | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете потребитеско име.   |
      | Pesho              |   Pass123!   | P123!         | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете еднакви пароли.     |
      | Pesho              |              | P123!         | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете парола.             |
      | Pesho              |   Pass123!   |               | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете парола.             |
      | Pesho              |              |               | pesho@abv.bg   |1234567892| Петър   | Петров |Въведете парола.             |
      | Pesho              |   Pass123!   | Pass123!      | pesho@abv.bg   |0892345678| Петър   | Петров |Има регистриран потребител с този телефонен номер.|
      | Pesho              |   Pass123!   | Pass123!      | pesho@abv.bg   |1234567891| Петър   | Петров |Въведете валиден телефонен номер. |
      | Pesho              |   Pass123!   | Pass123!      | pesho@abv.bg   |124567891 | Петър   | Петров |Въведете валиден телефонен номер. |
