Feature: Класиране на дете

 
  Scenario Outline: Класиране на дете от родител
    Given Потребителя отваря екрана за регистрация на дете
    When Въвежда собственото име на детето: "<Соб. име>"
    And Въвежда фамилното име на детето: "<Фам. Име>"
    And Въвежда рождената дата на детето: "<Рожден Ден>"
    And Въвежда дали детето е инвалид: "<Инвалид е>"
    And Въвежда броя на работещите родители: "<Работещи Родители>"
    And Въвежда дали детето има близнак: "<Има близнак>"
    And Натиска бутона за регистрация
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      |Соб. име|Фам. Име|Рожден Ден|Инвалид е|Работещи Родители|Има близнак|Съобщение                                     |
      |Иванчо  |Иванов  |2019-04-15|false    |2                |false      |Успешно регистриране, вашето дете има 2 точки.|
      |Иванчо  |Иванов  |2019-04-15|true     |2                |false      |Успешно регистриране, вашето дете има 4 точки.|
      |        |        |2019-04-15|false    |2                |false      |Моля въведете и двете имена на детето.        |
      |Иванчо  |        |2019-04-15|false    |2                |false      |Моля въведете и двете имена на детето.        |
      |        |Иванов  |2019-04-15|false    |2                |false      |Моля въведете и двете имена на детето.        |
      |Иванчо  |Иванов  |2021-04-15|false    |2                |false      |Детето ви е твърде малко или твърде голямо за детска градина.|
      |Иванчо  |Иванов  |2010-04-15|false    |2                |false      |Детето ви е твърде малко или твърде голямо за детска градина.|
      |Ivancho |Ivanov  |2018-04-12|false    |2                |false      |Детето ви е вече регистрирано.                |
